RGNagel/hello_world_stm32f103t4/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define s0_r_Pin GPIO_PIN_0
#define s0_r_GPIO_Port GPIOA
#define s0_y_Pin GPIO_PIN_1
#define s0_y_GPIO_Port GPIOA
#define s0_g_Pin GPIO_PIN_2
#define s0_g_GPIO_Port GPIOA
#define s1_r_Pin GPIO_PIN_3
#define s1_r_GPIO_Port GPIOA
#define s1_y_Pin GPIO_PIN_4
#define s1_y_GPIO_Port GPIOA
#define s1_g_Pin GPIO_PIN_5
#define s1_g_GPIO_Port GPIOA
#define s2_r_Pin GPIO_PIN_6
#define s2_r_GPIO_Port GPIOA
#define s2_y_Pin GPIO_PIN_7
#define s2_y_GPIO_Port GPIOA
#define s2_g_Pin GPIO_PIN_8
#define s2_g_GPIO_Port GPIOA
#define s3_r_Pin GPIO_PIN_9
#define s3_r_GPIO_Port GPIOA
#define s3_y_Pin GPIO_PIN_10
#define s3_y_GPIO_Port GPIOA
#define s3_g_Pin GPIO_PIN_11
#define s3_g_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
